# Python basics

In [4]:
print("aaa")

aaa

In [5]:
x = 1
y = 2
x + y

3

In [6]:
def addit(a, b):
    return a+b

In [8]:
addit(x, y)

3

In [9]:
lst = ["a","b","c","d"]
for element in lst:
    print(element)

a
b
c
d

In [10]:
if x < y:
    print("lower")
else:
    print("bigger or equal")

lower

In [11]:
dictionary = {
    'key1': 1,
    'key2': 2,
    'key3': 3
}
dictionary

{'key1': 1, 'key2': 2, 'key3': 3}

In [12]:
dictionary.items()

dict_items([('key1', 1), ('key2', 2), ('key3', 3)])

In [13]:
for k, v in dictionary.items():
    print(k)
    print(v)
    print("---")

key1
1
---
key2
2
---
key3
3
---

In [14]:
import pandas as pd

df = pd.DataFrame({
    'col1': ['a','b','c'],
    'col2': [1,2,3],
    'col3': [20,30,40]
})
df

  col1  col2  col3
0    a     1    20
1    b     2    30
2    c     3    40

## Basic operations: Column selection

In [15]:
df.col1

0    a
1    b
2    c
Name: col1, dtype: object

In [16]:
df["col1"]

0    a
1    b
2    c
Name: col1, dtype: object

In [17]:
df[["col1", "col2"]]

  col1  col2
0    a     1
1    b     2
2    c     3

In [18]:
df.index = ['row1','row2','row3']

In [19]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

## Basic operations: row selection

# df.loc[ ROWS_LST   , COLUMNS_LST]

# df.loc[   ["row1","row2"]   ,    :    ]

In [20]:
df.loc[["row1","row2"],:]

     col1  col2  col3
row1    a     1    20
row2    b     2    30

In [21]:
df.loc[["row1","row2"], ["col1", "col2"]]

     col1  col2
row1    a     1
row2    b     2

In [22]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

# df.iloc[   ROWS_POS , COL_POS   ]

In [23]:
df.iloc[  [0,2]  , [0,1]   ]

     col1  col2
row1    a     1
row3    c     3

In [ ]:
lst = ["a", "b", "c", "d", "e", "f"]


# SLICER SYNTAX:     [     FROM : TO        ]

# SLICER SYNTAX ONE-WAY  [ FROM : ]

# SLICER SYNTAX ONE-WAY [  :  TO ]

In [28]:
lst[1:5]

['b', 'c', 'd']

In [31]:
lst[:3], lst[2:], lst[:-3]

(['a', 'b', 'c'], ['c', 'd'], ['a'])

In [32]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [36]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [38]:
df_num = df[["col2", "col3"]]
df_num

      col2  col3
row1     1    20
row2     2    30
row3     3    40

In [39]:
df_num.sum(axis=0)

col2     6
col3    90
dtype: int64

In [40]:
df_num.sum(axis=1)

row1    21
row2    32
row3    43
dtype: int64

In [41]:
df_num

      col2  col3
row1     1    20
row2     2    30
row3     3    40

In [42]:
df_num.apply(lambda x: x+10, axis=0)

      col2  col3
row1    11    30
row2    12    40
row3    13    50

In [43]:
df_num.apply(lambda x: x+10, axis=1)

      col2  col3
row1    11    30
row2    12    40
row3    13    50

In [44]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [49]:
df2 = pd.DataFrame({
    'col1': ['a', 'b', 'd'],
    'col4': [777, 888, 999]
})
df2

  col1  col4
0    a   777
1    b   888
2    d   999

In [50]:
df

     col1  col2  col3
row1    a     1    20
row2    b     2    30
row3    c     3    40

In [52]:
pd.merge(df, df2, how="right", on="col1")

  col1  col2  col3  col4
0    a   1.0  20.0   777
1    b   2.0  30.0   888
2    d   NaN   NaN   999

In [65]:
df = pd.DataFrame({
    'country': ['PL', 'PL', 'USA', 'USA', "USA", "India", "India"],
    'age': [25, 20, 30, 35, 36, 20, 40],
    'height': [181, 171, 160, 150, 170, 191, 185],
    'city': ['Wroclaw', 'Warsaw', "NYC", "NYC", 'Washington', 'Delhi', 'Delhi']
})
df

   age        city country  height
0   25     Wroclaw      PL     181
1   20      Warsaw      PL     171
2   30         NYC     USA     160
3   35         NYC     USA     150
4   36  Washington     USA     170
5   20       Delhi   India     191
6   40       Delhi   India     185

In [66]:
import numpy as np

In [67]:
df.groupby(['country', 'city']).agg(
    {
    'age': [np.mean],
    'height': [np.sum, np.std]
    
}
)

                     age height
                    mean    sum       std
country city
India   Delhi       30.0    376  4.242641
PL      Warsaw      20.0    171       NaN
        Wroclaw     25.0    181       NaN
USA     NYC         32.5    310  7.071068
        Washington  36.0    170       NaN